In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
from IPython.display import display, Markdown
%matplotlib inline

In [4]:
df = pd.read_csv('Project/data_files/san_francisco/airbnb_union.csv')

In [5]:
df.describe()

,room_id,host_id,borough,reviews,overall_satisfaction,accommodates,bedrooms,price,minstay,latitude,longitude
count,2.055320e+05,2.055260e+05,0.0,205483.000000,159178.000000,197111.000000,194842.000000,205532.000000,134055.000000,205532.000000,205532.000000
mean,7.020337e+06,1.820178e+07,NaN,21.064959,3.959432,3.082111,1.346198,252.027290,3.528656,37.768150,-122.430243
std,4.841478e+06,2.250471e+07,NaN,39.716682,1.807185,1.931360,0.897208,437.442457,9.051024,0.021394,0.025123
min,9.580000e+02,4.600000e+01,NaN,0.000000,0.000000,1.000000,0.000000,0.000000,1.000000,37.708278,-122.513065
25%,2.433743e+06,2.597104e+06,NaN,1.000000,4.500000,2.000000,1.000000,108.000000,1.000000,37.754118,-122.441740
50%,6.988943e+06,8.539143e+06,NaN,5.000000,5.000000,2.000000,1.000000,167.000000,2.000000,37.770237,-122.425592
75%,1.077237e+07,2.580596e+07,NaN,22.000000,5.000000,4.000000,2.000000,256.000000,3.000000,37.785236,-122.412920
max,1.978199e+07,1.395538e+08,NaN,513.000000,5.000000,18.000000,10.000000,30000.000000,1000.000000,37.831093,-122.363243

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 205532 entries, 0 to 205531
Data columns (total 15 columns):
room_id                 205532 non-null int64
host_id                 205526 non-null float64
room_type               205489 non-null object
borough                 0 non-null float64
neighborhood            205532 non-null object
reviews                 205483 non-null float64
overall_satisfaction    159178 non-null float64
accommodates            197111 non-null float64
bedrooms                194842 non-null float64
price                   205532 non-null int64
minstay                 134055 non-null float64
latitude                205532 non-null float64
longitude               205532 non-null float64
last_modified           205532 non-null object
date_collected          205532 non-null object
dtypes: float64(9), int64(2), object(4)
memory usage: 23.5+ MB

In [8]:
display(df.groupby('room_type')['room_type'].count())

room_type
Entire home/apt    121681
Private room        76404
Shared room          7404
Name: room_type, dtype: int64

In [43]:
host_grouped = df[df['room_type'] == 'Entire home/apt'].\
groupby(['date_collected','host_id'])['room_id'].count().to_frame()

In [44]:
host_grouped.tail()

                            room_id
date_collected host_id
2017-07-10     139004053.0        1
               139132883.0        1
               139134376.0        1
               139315170.0        1
               139553832.0        1

In [42]:
host_grouped.info()

<class 'pandas.core.frame.DataFrame'>
MultiIndex: 20 entries, (2013-11-17, 38836.0) to (2013-11-17, 652918.0)
Data columns (total 1 columns):
room_id    20 non-null int64
dtypes: int64(1)
memory usage: 95.4+ KB

In [72]:
host_grouped['bin'] = pd.cut(x = host_grouped['room_id'], bins =[0,1,1000], labels = ['1','2+'])

In [83]:
host_grouped.tail()

                            room_id bin
date_collected host_id
2017-07-10     139004053.0        1   1
               139132883.0        1   1
               139134376.0        1   1
               139315170.0        1   1
               139553832.0        1   1

In [86]:
host_grouped.groupby('bin').count()

     room_id
bin
1     103629
2+      6335

In [87]:
pd.crosstab(host_grouped['room_id'],host_grouped['bin']).sum()

bin
1     103629
2+      6335
dtype: int64

In [89]:
host_grouped[host_grouped['bin'] == '1']['room_id'].sum()

103629

In [91]:
host_grouped[host_grouped['bin'] == '2+']['room_id'].sum()

18052

In [94]:
host_grouped[host_grouped['bin'] == '2+']['room_id'].plot()

AttributeError: 'numpy.int64' object has no attribute 'plot'